zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEray_reg.h
/** \brief 94, PRT Configuration Register 2 */
#define ERAY0_PRTC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_PRTC2*)0xF001C094u)

/** \brief 98, MHD Configuration Register */
#define ERAY0_MHDC /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MHDC*)0xF001C098u)

/** \brief A0, GTU Configuration Register 1 */
#define ERAY0_GTUC01 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC01*)0xF001C0A0u)

/** \brief A4, GTU Configuration Register 2 */
#define ERAY0_GTUC02 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC02*)0xF001C0A4u)

/** \brief A8, GTU Configuration Register 3 */
#define ERAY0_GTUC03 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC03*)0xF001C0A8u)

/** \brief AC, GTU Configuration Register 4 */
#define ERAY0_GTUC04 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC04*)0xF001C0ACu)

/** \brief B0, GTU Configuration Register 5 */
#define ERAY0_GTUC05 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC05*)0xF001C0B0u)

/** \brief B4, GTU Configuration Register 6 */
#define ERAY0_GTUC06 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC06*)0xF001C0B4u)

/** \brief B8, GTU Configuration Register 7 */
#define ERAY0_GTUC07 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC07*)0xF001C0B8u)

/** \brief BC, GTU Configuration Register 8 */
#define ERAY0_GTUC08 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC08*)0xF001C0BCu)

/** \brief C0, GTU Configuration Register 9 */
#define ERAY0_GTUC09 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC09*)0xF001C0C0u)

/** \brief C4, GTU Configuration Register 10 */
#define ERAY0_GTUC10 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC10*)0xF001C0C4u)

/** \brief C8, GTU Configuration Register 11 */
#define ERAY0_GTUC11 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC11*)0xF001C0C8u)

/** \brief 100, Communication Controller Status Vector */
#define ERAY0_CCSV /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_CCSV*)0xF001C100u)

/** \brief 104, Communication Controller Error Vector */
#define ERAY0_CCEV /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_CCEV*)0xF001C104u)

/** \brief 110, Slot Counter Value */
#define ERAY0_SCV /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SCV*)0xF001C110u)

/** \brief 114, Macrotick and Cycle Counter Value */
#define ERAY0_MTCCV /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MTCCV*)0xF001C114u)

/** \brief 118, Rate Correction Value */
#define ERAY0_RCV /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RCV*)0xF001C118u)

/** \brief 11C, Offset Correction Value */
#define ERAY0_OCV /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OCV*)0xF001C11Cu)

/** \brief 120, SYNC Frame Status */
#define ERAY0_SFS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SFS*)0xF001C120u)

/** \brief 124, Symbol Window and Network Idle Time Status */
#define ERAY0_SWNIT /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SWNIT*)0xF001C124u)

/** \brief 128, Aggregated Channel Status */
#define ERAY0_ACS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ACS*)0xF001C128u)

/** \brief 130, Even Sync ID Symbol Window 1 */
#define ERAY0_ESID_1S0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C130u)
/** Alias (User Manual Name) for ERAY0_ESID_1S0.
* To use register names with standard convension, please use ERAY0_ESID_1S0.
*/
#define ERAY0_ESID01 (ERAY0_ESID_1S0)

/** \brief 134, Even Sync ID Symbol Window 2 */
#define ERAY0_ESID_1S1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C134u)
/** Alias (User Manual Name) for ERAY0_ESID_1S1.
* To use register names with standard convension, please use ERAY0_ESID_1S1.
*/
#define ERAY0_ESID02 (ERAY0_ESID_1S1)

/** \brief 138, Even Sync ID Symbol Window 3 */
#define ERAY0_ESID_1S2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C138u)
/** Alias (User Manual Name) for ERAY0_ESID_1S2.
* To use register names with standard convension, please use ERAY0_ESID_1S2.
*/
#define ERAY0_ESID03 (ERAY0_ESID_1S2)

/** \brief 13C, Even Sync ID Symbol Window 4 */
#define ERAY0_ESID_1S3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C13Cu)
/** Alias (User Manual Name) for ERAY0_ESID_1S3.
* To use register names with standard convension, please use ERAY0_ESID_1S3.
*/
#define ERAY0_ESID04 (ERAY0_ESID_1S3)

/** \brief 140, Even Sync ID Symbol Window 5 */
#define ERAY0_ESID_1S4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C140u)
/** Alias (User Manual Name) for ERAY0_ESID_1S4.
* To use register names with standard convension, please use ERAY0_ESID_1S4.
*/
#define ERAY0_ESID05 (ERAY0_ESID_1S4)

/** \brief 144, Even Sync ID Symbol Window 6 */
#define ERAY0_ESID_1S5 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C144u)
/** Alias (User Manual Name) for ERAY0_ESID_1S5.
* To use register names with standard convension, please use ERAY0_ESID_1S5.
*/
#define ERAY0_ESID06 (ERAY0_ESID_1S5)

/** \brief 148, Even Sync ID Symbol Window 7 */
#define ERAY0_ESID_1S6 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C148u)
/** Alias (User Manual Name) for ERAY0_ESID_1S6.
* To use register names with standard convension, please use ERAY0_ESID_1S6.
*/
#define ERAY0_ESID07 (ERAY0_ESID_1S6)

/** \brief 14C, Even Sync ID Symbol Window 8 */
#define ERAY0_ESID_1S7 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C14Cu)
/** Alias (User Manual Name) for ERAY0_ESID_1S7.
* To use register names with standard convension, please use ERAY0_ESID_1S7.
*/
#define ERAY0_ESID08 (ERAY0_ESID_1S7)

/** \brief 150, Even Sync ID Symbol Window 9 */
#define ERAY0_ESID_1S8 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C150u)
/** Alias (User Manual Name) for ERAY0_ESID_1S8.
* To use register names with standard convension, please use ERAY0_ESID_1S8.
*/
#define ERAY0_ESID09 (ERAY0_ESID_1S8)

/** \brief 154, Even Sync ID Symbol Window 10 */
#define ERAY0_ESID_1S9 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C154u)
/** Alias (User Manual Name) for ERAY0_ESID_1S9.
* To use register names with standard convension, please use ERAY0_ESID_1S9.
*/
#define ERAY0_ESID10 (ERAY0_ESID_1S9)

/** \brief 158, Even Sync ID Symbol Window 11 */
#define ERAY0_ESID_1S10 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C158u)
/** Alias (User Manual Name) for ERAY0_ESID_1S10.
* To use register names with standard convension, please use ERAY0_ESID_1S10.
*/
#define ERAY0_ESID11 (ERAY0_ESID_1S10)

/** \brief 15C, Even Sync ID Symbol Window 12 */
#define ERAY0_ESID_1S11 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C15Cu)
/** Alias (User Manual Name) for ERAY0_ESID_1S11.
* To use register names with standard convension, please use ERAY0_ESID_1S11.
*/
#define ERAY0_ESID12 (ERAY0_ESID_1S11)

/** \brief 160, Even Sync ID Symbol Window 13 */
#define ERAY0_ESID_1S12 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C160u)
/** Alias (User Manual Name) for ERAY0_ESID_1S12.
* To use register names with standard convension, please use ERAY0_ESID_1S12.
*/
#define ERAY0_ESID13 (ERAY0_ESID_1S12)

/** \brief 164, Even Sync ID Symbol Window 14 */
#define ERAY0_ESID_1S13 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C164u)
/** Alias (User Manual Name) for ERAY0_ESID_1S13.
* To use register names with standard convension, please use ERAY0_ESID_1S13.
*/
#define ERAY0_ESID14 (ERAY0_ESID_1S13)

